In [7]:
import pandas as pd

In [8]:
df = pd.read_csv('Data_Visualisation.csv', sep=',' , encoding='latin-1')

In [9]:
df.head()

,College,Flutter (skill out of 5),Flask (skill out of 5),Firebase (skill out of 5),GCP (skill out of 5),AWS (skill out of 5),Predictive Modelling (skill out of 5),EDA (skill out of 5),NLP (skill out of 5)
0,JDIET,2.0,4.0,4.0,1.0,1.0,1.0,1.0,4.0
1,Indian Institute of Information Technology Des...,4.0,1.0,1.0,3.0,1.0,4.0,5.0,4.0
2,Manipal Institute of technology,2.0,2.0,2.0,1.0,1.0,2.0,2.0,2.0
3,Delhi Technological Univeesity,NaN,4.0,NaN,NaN,NaN,NaN,3.0,NaN
4,Jabalpur Engineering College,2.0,2.0,4.0,4.0,1.0,4.0,4.0,4.0

In [10]:
df.describe()

,Flutter (skill out of 5),Flask (skill out of 5),Firebase (skill out of 5),GCP (skill out of 5),AWS (skill out of 5),Predictive Modelling (skill out of 5),EDA (skill out of 5),NLP (skill out of 5)
count,138.000000,136.000000,138.000000,132.000000,130.000000,144.000000,144.000000,135.000000
mean,1.768116,1.992647,1.992754,1.643939,1.884615,2.812500,2.993056,2.451852
std,1.082642,1.125439,1.117194,0.925735,1.008757,1.273554,1.366413,1.226076
min,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000
25%,1.000000,1.000000,1.000000,1.000000,1.000000,2.000000,2.000000,1.000000
50%,1.000000,2.000000,2.000000,1.000000,2.000000,3.000000,3.000000,2.000000
75%,2.750000,3.000000,3.000000,2.000000,3.000000,4.000000,4.000000,3.000000
max,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000

In [11]:
df.columns

Index(['College', 'Flutter (skill out of 5)', 'Flask (skill out of 5)',
       'Firebase (skill out of 5)', 'GCP (skill out of 5)',
       'AWS (skill out of 5)', 'Predictive Modelling (skill out of 5)',
       'EDA (skill out of 5)', 'NLP (skill out of 5)'],
      dtype='object')

In [12]:
df.College

0                                                  JDIET
1      Indian Institute of Information Technology Des...
2                       Manipal Institute of technology
3                         Delhi Technological Univeesity
4                           Jabalpur Engineering College
                             ...
150          The LNM Institute of Information Technology
151                pandit deendayal petroleum university
152                                                  MEC
153          Lal Bahadur Shastri Institute of Management
154                          Bms institute of technology
Name: College, Length: 155, dtype: object

In [13]:
df1 = pd.factorize(df["College"])

In [14]:
df1

(array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  10,  11,
         12,  13,  12,  14,  15,  16,  17,  15,  18,  19,  20,  21,  22,
         23,  24,  25,  26,  27,  28,  29,  30,  31,  32,  33,  34,  35,
         36,  29,  37,  38,  39,  40,  41,  42,  43,  44,  45,  46,  47,
         48,  49,  50,  19,  20,  51,  52,  53,  54,  17,  55,  56,  57,
         58,  59,  60,  61,  62,  63,  64,  65,  66,  67,  68,  69,  70,
         71,  72,  73,  74,  75,  28,  76,  77,  45,  78,  79,  80,  81,
         17,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,  92,  93,
         94,  95,  96,  97,  98,  99, 100, 101, 102,  97, 103, 104, 105,
        106,  86,  90, 107, 108,  98, 109, 110, 111, 112, 113, 114, 115,
        116, 117,  76, 118, 119, 120, 121,  98, 122, 123,  64, 123, 124,
        125, 126, 127, 128, 129, 128, 130, 131, 132, 133, 134, 135],
       dtype=int64),
 Index(['JDIET',
        'Indian Institute of Information Technology Design and Manufacturing, Kurnool',
        'Manipal Institute of technology ', 'Delhi Technological Univeesity',
        'Jabalpur Engineering College',
        'Muffakham Jah College Of Engineering and Technology',
        'Govt. College of engineering and technology bikaner', 'GRIET',
        'Indian Institute of Information Technology Design and Manufacturing Kurnool ',
        'DR. DR. shyama Prasad MUKHERJEE UNIVERSITY ',
        ...
        'Indian Institute of information technology Bhopal',
        'Vivekananda Education Society's Institute of Technology, Mumbai',
        'Maharaja Surajmal Institute of Technology', 'VIT University, Vellore',
        'Jaypee Institute Of Information Technology',
        'The LNM Institute of Information Technology',
        'pandit deendayal petroleum university', 'MEC',
        'Lal Bahadur Shastri Institute of Management',
        'Bms institute of technology'],
       dtype='object', length=136))

In [15]:
for i in range(len(df.College)):
    if df.College[i]=="Gitam university, Vizag":
        print(i,df.College[i],df["NLP (skill out of 5)"][i])

74 Gitam university, Vizag 2.0

In [16]:
df.College[74]

'Gitam university, Vizag'

In [17]:
df["NLP (skill out of 5)"][74]

2.0

In [18]:
df.head(75)

,College,Flutter (skill out of 5),Flask (skill out of 5),Firebase (skill out of 5),GCP (skill out of 5),AWS (skill out of 5),Predictive Modelling (skill out of 5),EDA (skill out of 5),NLP (skill out of 5)
0,JDIET,2.0,4.0,4.0,1.0,1.0,1.0,1.0,4.0
1,Indian Institute of Information Technology Des...,4.0,1.0,1.0,3.0,1.0,4.0,5.0,4.0
2,Manipal Institute of technology,2.0,2.0,2.0,1.0,1.0,2.0,2.0,2.0
3,Delhi Technological Univeesity,NaN,4.0,NaN,NaN,NaN,NaN,3.0,NaN
4,Jabalpur Engineering College,2.0,2.0,4.0,4.0,1.0,4.0,4.0,4.0
...,...,...,...,...,...,...,...,...,...
70,MUFFAKHAM JAH college of engineering and techn...,3.0,3.0,3.0,3.0,3.0,3.0,3.0,3.0
71,Mahindra ecole centrale,3.0,2.0,2.0,3.0,4.0,5.0,5.0,4.0
72,Veer Surendra sai University of technology,1.0,1.0,2.0,1.0,2.0,2.0,2.0,NaN
73,The Northcap University,1.0,1.0,2.0,1.0,3.0,4.0,4.0,1.0
74,"Gitam university, Vizag",1.0,1.0,1.0,1.0,3.0,3.0,4.0,2.0

In [19]:
(2/16)*100

12.5

In [20]:
df.shape

(155, 9)

In [21]:
df.loc[0][0]

'JDIET'